{
  "1.8b2-34": "- New design",
  "1.8-35": "- New design: the Letterbox player design has been updated according to the new official specifications.\n- Resizable: the Letterbox player view behaves well for tiny screen sizes.\n- Playlists: supplied by an associated data source.\n- Continuous playback: when media playback ends, applications can optionally provide a delay after which the next item in the playlist will be automatically played.",
  "1.9-36": "- Fix livestream initial erratic behavior on iOS 11.3.",
  "1.9.1-37": "- Fix notification color.",
  "1.9.2-38": "- Maintenance release",
  "1.9.3-39": "- Improve time slider design.\n- Update media placeholder and red color for the live only label.\n- When entering picture in picture, the picture in picture button does not toggle erratically between states anymore.",
  "1.9.4-40": "- An issue sometimes preventing player controls from being toggled when VoiceOver is used has been fixed.\n- The red color associated with livestreams has been updated consistently.\n- The \"livestream ended\" notification isn't displayed anymore when opening a VOD, linked to an expired livestream.",
  "1.9.5-41": "- The popup attached to the slider know is now displayed in red when a DVR stream is played in live conditions.\n- The player is now more resilient against playback interruptions due to resource metadata updates.",
  "1.9.6-42": "- Maintenance release.",
  "1.9.7-43": "- Continuous playback UI displays the next media title and its show title, if any.",
  "1.9.8b1-44": "- DRM streams are now played when available.\n- Performance improvements.\n- AirPlay instability fix for Akamai streams.\n- Fix issue incorrectly leading livestreams to be stopped in some cases.\n- A setting for enabling standalone mode widely has been added.\n- Topics can be accessed directly, even on our mobile team development server (MMF).",
  "1.10-45": "### Digital rights management support\n\n- DRM-protected streams can now be played.\n- Performance improvements.\n- AirPlay instability fix for Akamai streams.\n- Fix issue incorrectly leading livestreams to be stopped in some cases.\n- A setting for enabling standalone mode widely has been added.\n- Topics can be accessed directly, even on our mobile team development server (MMF).",
  "1.10.1-46": "- Fix iTunes Connect binary submission.",
  "1.11-47": "- Digital rights management support has been updated.\n- Anonymous diagnostic information is collected in proprietary builds for quality measurement purposes.\n- An issue affecting seeks in DVR streams has been fixed.\n- Xcode 10 support with iOS 12 SDK.",
  "1.11.1-48": "- On iOS 10 devices and above, the control center now displays Live when playing a DVR livestream played in live conditions\n- An issue leading Apple TV receivers to sometimes display information from several medias at the same time has been fixed.",
  "1.11.1-49": "- Fix demo application update detection",
  "1.12-50": "- Fixes continuous playback interrupting playback of a new media, chapter or segment. Moreover, the Letterbox view now does not display any timeline anymore when the continuous playback screen is visible.\n- Fixes DVR livestreams incorrectly starting at the DVR window beginning.",
  "1.12.1-51": "- Maintenance release",
  "1.13-52": "- Subtitle and audio track selection has been improved. For subtitles you can now choose between _Automatic_ (a recommended choice is made based on system settings, content and app languages), an explicit track, or _Off_ (only forced subtitles might be displayed in this case).",
  "1.14b1-53": "- Add SMDH analytics support with the new ComScore SDK.\n- Subtitles management: an application can force a preferred subtitle localization.\n- Remove subdivision favorites support.\n",
  "1.14b2-54": "- Fix loading indicator erratic behavior.",
  "1.14b3-55": "- Don't send statistics if no data provided in the chapter.",
  "1.14b4-56": "- Set exact DVR window frame for SDH analytic.",
  "1.14b5-57": "- Set exact DVR window frame at stop event for SDH analytics.",
  "1.14-58": "### SMDH streaming measurements\n\n- Streaming measurements are now performed according to NetMetrix SMDH specifications.\n- API provides a way to customize subtitle and audio tracks programatically.\n- Letterbox view support for favorites has been removed.\n- The framework footprint at application startup time has been reduced.",
  "1.14.1-59": "- Maintenance release.\n- (SRGAnalytics) Fix iTunes Connect validation warning.",
  "1.14.1-60": "- Maintenance release.\n- (SRGAnalytics) Fix iTunes Connect validation warning.",
  "1.14.2-61": "- The time needed to display the Letterbox player view has been significantly reduced, and the view is better suited for use in scroll views.\n- Fix non-working lock screen video playback on devices running iOS 12.3 and above.\n- A new setting can be used to enable full background video playback.\n- Fix crash on iOS 13. Full iOS 13 is not implemented officially yet, though Letterbox should run fine already.\n- Medias can be directly opened in this demo application using the `letterbox` URL scheme.",
  "1.14.3-62": "- Maintenance release.\n- Stream quality can be changed in the application settings.",
  "1.14.4-63": "- The track selection interface has been updated.\n- iOS 13 preliminary support.\n- Check for application updates button in the settings view restored.",
  "1.14.4-64": "- The demo application supports the new scheme url format.",
  "1.14.5-65": "- Fix partial diagnostics performance reports sent when playing some medias.\n- Demo application supports iOS 13 dark mode.",
  "1.15-66": "- Audio session management removal.\n- Autoplay with muted videos example added in this demonstration application.",
  "1.15-67": "- Update demo application with the new App Center distribution service.",
  "2.0.0-rc.1-68": "- First Letterbox tvOS RC version. (tvOS)\n- Automatic playback restart after system interruption (iOS) (e.g. alarm clock, phone call).\n- Long-form playback and control center improvements (iOS) (seek bar, AirPlay track selection, Siri controls).\n- Upgrade to comScore version 6.",
  "2.0.0-69": "### tvOS support\n\n- The library is compatible with tvOS.\n- The control center integration has been improved:\n    - The seek bar can be used to navigate in the media being played.\n    - When using AirPlay, subtitles and audio tracks can be changed directly from the control center.\n    - Playback controls through Siri have been improved.\n- Playback automatically resumes after audio interruption (e.g. phone call or alarm).\n- Data consumption has been reduced.\n- Fixed issue restarting stopped playback after network is reachable again.\n- Fixed issue incorrectly leading to livestreams being paused instead of stopped when using split view.\n\n- Demonstration application has media lists from all SRG business units.",
  "3.0.0-70": "## Audio tracks and subtitle support\n\nAudio track and subtitle support has been greatly improved to be more consistent and user-friendly. For more information, refer to the [SRG Media Player release notes](https://github.com/SRGSSR/srgmediaplayer-apple/releases/tag/3.0.0).\n\n### iOS and tvOS\n\n- Default audio selection now takes the application language into account, as well as user preferred languages.\n- Automatic subtitle selection automatically enables or disables subtitles based on the chosen audio language.\n- Media configuration could be made programatically by assigning a block to the `mediaConfigurationBlock`. This single block has been replaced with two specific `audioConfigurationBlock` and `subtitleConfigurationBlock` blocks. Refer to the updated documentation to see how these blocks should be implemented so that you can update your code appropriately.\n- Subtitle styling was previously made with the `mediaConfigurationBlock`. It must now be made with the new dedicated `textStyleRules` controller property.\n- The `-reloadMediaConfigurationWithBlock:` controller method has been removed. If you need to update a configuration block and apply the changes, update the associated block property and call `-reloadMediaConfiguration` afterwards.\n\n### iOS only\n\n- The audio and subtitle choice button is not displayed anymore for content without visible subtitles, e.g. livestreams (currently).\n- The user experience has been refined.\n- Subtitle and audio selection is preserved when enabling AirPlay.\n\n## Other changes\n\nA few fixes and improvements have been made as well.\n\n### iOS and tvOS\n\n- OS version tracking for Mapp (Webtrekk) reporting has been fixed.\n- Player and UI component energy efficiency has been improved (the number of refreshes has been reduced). In particular, non-required background activity has been eliminated.\n\n### iOS only\n\n- Fix iTunesConnect submission issue due to `UIWebView` deprecation.\n- Fix automatic resume after change of routes.\n- Fix AirPlay playback short interruptions when playing the same media.\n- Fix incorrect memory management when using picture in picture is used, leading to possibly unreleased view controllers.\n- Fix sometimes incorrect position when seeking with the control center slider.\n- Properly reset control center when playback stops.\n- Picture in picture and AirPlay play along in a more natural way. When PiP is enabled, external playback is now prevented automatically (only audio might is routed to the receiver).",
  "3.0.1-71": "- 'Live' has been replaced with 'Direct' in French.\n- Fix issue limiting titles to one line instead of two in the segment and chapter timeline.\n- Fix issue preventing the timeline horizontal scrolling indicator from being visible when the system light UI appearance is used.",
  "4.0.0-72": "- Support for medias with various aspect ratios has been improved.",
  "5.0.0-73": "## Improved livestream support\n\nThe built-in user experience for livestreams, especially those supporting DVR, has been largely improved. In particular, users can now see which programs have been broadcasted during the last few hours and easily navigate among them.\n\n### iOS only\n\n- Letterbox view timeline displays the programs available within the current DVR window.\n- A _start over_ button has been added to restart the current program at its start.\n\n### tvOS only\n\n- Programs available within the current DVR window are displayed in the top info panel.\n\n## iOS improvements and design changes\n\n- The timeline design has been updated for better readability.\n- An issue preventing devices from correctly locking while playing video in background has been fixed. More generally, Letterbox will never prevent your device from sleeping when there is no video displayed. Note that this works best on devices running on iOS 12 and above.\n\n## iOS fixes\n\n- Player playback controls (skips, start over, back to live) are now simply disabled instead of hidden when unavailable.\n- Cell glitches (scaling) which could sometimes be seen when opening the timeline have been fixed.\n- Fix seek imprecisions when using a Bluetooth headset.\n- Fix incorrect user interface controls possibly displayed after a DVR livestream has been paused.\n- Fix incorrect state when returning a paused DVR livestream to live conditions.\n- Fix livestreams without DVR incorrectly pausable from the control center.",
  "5.0.1-74": "- Avoid screen dimming when playing a video with sound routed over AirPlay.\n- Correctly take into account SDH accessibility opt-in when choosing subtitles automatically.\n- Fix application potentially becoming unresponsive when starting audio playback.",
  "5.0.2-75": "- This release fixes an iOS 14 regression leading to the player still continuing playback of a video in the background, even after having been properly released.",
  "5.0.3-76": "\n- Update comScore analytics for iOS 14.\n- Update age rating icons and remove all FSK references.",
  "6.0.0-77": "- Improve compatibility with iOS and tvOS 14.\n- Add picture in picture support for tvOS 14.",
  "6.1.0-78": "- Updated analytics (Mediapulse and duration fix for Webtrekk).\n- Enable control center controls when using picture in picture."
}