{
  "1.8b2-34": "- New design",
  "1.8-35": "- New design: the Letterbox player design has been updated according to the new official specifications.\n- Resizable: the Letterbox player view behaves well for tiny screen sizes.\n- Playlists: supplied by an associated data source.\n- Continuous playback: when media playback ends, applications can optionally provide a delay after which the next item in the playlist will be automatically played.",
  "1.9-36": "- Fix livestream initial erratic behavior on iOS 11.3.",
  "1.9.1-37": "- Fix notification color.",
  "1.9.2-38": "- Maintenance release",
  "1.9.3-39": "- Improve time slider design.\n- Update media placeholder and red color for the live only label.\n- When entering picture in picture, the picture in picture button does not toggle erratically between states anymore.",
  "1.9.4-40": "- An issue sometimes preventing player controls from being toggled when VoiceOver is used has been fixed.\n- The red color associated with livestreams has been updated consistently.\n- The \"livestream ended\" notification isn't displayed anymore when opening a VOD, linked to an expired livestream.",
  "1.9.5-41": "- The popup attached to the slider know is now displayed in red when a DVR stream is played in live conditions.\n- The player is now more resilient against playback interruptions due to resource metadata updates.",
  "1.9.6-42": "- Maintenance release.",
  "1.9.7-43": "- Continuous playback UI displays the next media title and its show title, if any.",
  "1.9.8b1-44": "- DRM streams are now played when available.\n- Performance improvements.\n- AirPlay instability fix for Akamai streams.\n- Fix issue incorrectly leading livestreams to be stopped in some cases.\n- A setting for enabling standalone mode widely has been added.\n- Topics can be accessed directly, even on our mobile team development server (MMF).",
  "1.10-45": "### Digital rights management support\n\n- DRM-protected streams can now be played.\n- Performance improvements.\n- AirPlay instability fix for Akamai streams.\n- Fix issue incorrectly leading livestreams to be stopped in some cases.\n- A setting for enabling standalone mode widely has been added.\n- Topics can be accessed directly, even on our mobile team development server (MMF).",
  "1.10.1-46": "- Fix iTunes Connect binary submission.",
  "1.11-47": "- Digital rights management support has been updated.\n- Anonymous diagnostic information is collected in proprietary builds for quality measurement purposes.\n- An issue affecting seeks in DVR streams has been fixed.\n- Xcode 10 support with iOS 12 SDK.",
  "1.11.1-48": "- On iOS 10 devices and above, the control center now displays Live when playing a DVR livestream played in live conditions\n- An issue leading Apple TV receivers to sometimes display information from several medias at the same time has been fixed."
}